from django.shortcuts import render
from django.http import HttpResponse

from sushi.models import Categories

# Create your views here.

def index(request):

    context = {
        'title': 'Sushi-bar - Головна',
        'content' : 'Суші-бар Акамедзутсу',
    }
    return render(request,'main/index.html',context )

def about(request):
    context = {
        'title': 'Sushi-bar - О нас',
        'content': 'О нас',
        "text_on_page": "Ласкаво просимо до суші-бару Акамедзутсу!"
                        "Ми раді вітати вас на нашому веб-сайті, де ви можете легко і зручно замовити найсмачніші суші, роли, макі, нігірі та інші японські делікатеси."
                        "У Акамедзутсу ми поєднуємо традиційні рецепти з сучасними інноваціями, щоб створювати справжні кулінарні шедеври, які підкорять ваше серце."
                        "Насолоджуйтеся класичними суші, приготованими з найсвіжіших інгредієнтів. Від ніжного тунця до соковитого лосося – кожен шматочок приносить справжнє задоволення."
                        "Наші роли – це справжнє мистецтво. Спробуйте улюблені Філадельфію, Каліфорнію або відкрийте для себе щось нове з нашого ексклюзивного асортименту."
                        "Маленькі, але дуже смачні макі – ідеальний вибір для тих, хто хоче спробувати різні смаки. У нас ви знайдете макі з авокадо, огірком, тунцем та іншими начинками.Ми прагнемо зробити ваші обіди та вечері незабутніми. Приєднуйтеся до нашої великої родини любителів японської кухні та насолоджуйтесь найкращими суші у вашому місті!"
    }
    return render(request, 'main/about.html', context)

def info(request):
    context = {
        'title': 'Sushi-bar - Контакта інформація',
        'content': 'Номера телефонів',
        "text_on_page": "Наші номера телефонів:  066 511 43 65 / 095 534 34 64 "
    }
    return render(request, 'main/info.html', context)
